lib = {
    0: """
Кажется, на фото присутствуют прилегающие дефекты — брызги, прожоги от дуги.

Возможные причины:

Высокий сварочный ток;
Слишком низкое напряжение;
Рабочий угол электрода слишком большой;
Плохая зачистка свариваемых поверхностей;
Сварка длинной дугой;
Неправильная полярность;

Способы предупреждения:

Очистить поверхности перед сваркой;
Уменьшить длину дуги;
Отрегулировать сварочный ток;
Увеличить угол электрода;
Соблюдать полярность;

Способы устранения:

Зачистить шлифовальным инструментом поверхность сварного соединения от брызг металла.
""",
    1: """"
Кажется, на фото присутствуют дефекты целостности — кратер, шлак, свищ, пора, прожог.

Возможные причины:

Недостаточная прокалка электрода перед началом работы;
Сварка длинной дугой;
Плохая газовая защита сварочной ванны;
Неправильная обработка поверхности перед началом работы;
Работа по загрязненной поверхности;
Наличие ржавчины, краски, жира или масла на металле;

Способы предупреждения:

Очистить поверхность свариваемого металла перед сваркой;
Прокалить электроды;
Проверить расходомер газа и убедиться, что он оптимизирован в соответствии с требованиями с соответствующими настройками давления и расхода;
Снизить скорость движения дуги, чтобы газы улетучились;
Использовать правильную технику сварки;

Способы устранения:

Дефектный участок вырубают или вычищают и вновь заваривают. 
""",
    2: """"
Кажется, на фото присутствуют дефекты геометрии — подрез, непровар, наплыв, чешуйчатость, западание, неравномерность.

Возможные причины:

Слишком высокий сварочный ток;
Слишком высокая скорость сварки;
Неудобное пространственное положение, из-за которого к свободным краям будет направлено больше тепла;
Неточное ведение электрода по оси стыка;
Неправильный присадочный металл;
Плохая техника сварки.

Способы предупреждения:

Ведение электрод под правильным углом;
Проведение сварки короткой дугой;
Выбор оптимального режима сварки;
Выбор защитного газа, состав которого соответствует типу материала, который будут сваривать;
Использование электродов под правильным углом, при этом большее количество тепла нужно направлять на более толстые компоненты;
Регулировать силу тока, уменьшая его при приближении к более тонким участкам и свободным краям.

Способы устранения:

Место подреза зачищают и заваривают шов заново.
""",
    3: """"
Кажется, на фото присутствуют дефекты постобработки — заусенец, торец, задир, забоина.
""",
    4: """"
Кажется, на фото присутствуют дефекты невыполнения — незаполнение раковины, несплавление.

Возможные причины:

Между свариваемым металлом было слишком много места;
Низкие настройках силы тока, которого недостаточно, чтобы должным образом расплавить металл;
Используются электроды большого диаметра.

Способы предупреждения:

Использовать правильную геометрию шва;
Использовать электрод подходящего размера;
Снизить скорость дуги;
Выбрать подходящий сварочный ток;
Проверить правильность центровки.

Способы устранения:

Если несплавление доступно для повторной заварки, то корень шва в месте дефекта вычищают и заваривают повторно.
"""
}